app/controllers/campgrounds_controller.rb

SELECT * FROM "campgrounds" WHERE ("campgrounds"."id" = 1)
---
  def show
    @campground = Campground.find(params[:id])