app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.create(params[:reservation])
---
INSERT INTO "reservations" ("group_number", "start_date", "created_at", "council_name", "updated_at", "group_type", "other_group_name", "end_date", "campsite_id", "district_name") VALUES(0, '2009-07-18 00:00:00', '2009-07-18 18:47:03', 'fdasf', '2009-07-18 18:47:03', 'fda', 'fdasf', '2009-07-19 00:00:00', NULL, 'fdasfd')

  def set_paid
    @reservation = Reservation.find(params[:id])
---
SELECT * FROM "reservations" WHERE ("reservations".campsite_id = 1) AND ((strftime('%W', start_date) = '28') AND ("reservations".campsite_id = 1))

  def find_campground
    @campground = Campground.find(params[:campground_id])
---
SELECT * FROM "campgrounds" WHERE ("campgrounds"."id" = '--- :campground_id